zigaobj/smarthousehash/trunk/stm8_map.h
/*----------------------------------------------------------------------------*/
/**
  * @brief 16-bit timer (TIM2)
  */

typedef volatile struct TIM2_struct
{
  u8 CR1;   /*!< control register 1 */
  u8 IER;   /*!< interrupt enable register */
  u8 SR1;   /*!< status register 1 */
  u8 SR2;   /*!< status register 2 */
  u8 EGR;   /*!< event generation register */
  u8 CCMR1; /*!< CC mode register 1 */
  u8 CCMR2; /*!< CC mode register 2 */
  u8 CCMR3; /*!< CC mode register 3 */
  u8 CCER1; /*!< CC enable register 1 */
  u8 CCER2; /*!< CC enable register 2 */
  u8 CNTRH; /*!< counter high */
  u8 CNTRL; /*!< counter low */
  u8 PSCR;  /*!< prescaler register */
  u8 ARRH;  /*!< auto-reload register high */
  u8 ARRL;  /*!< auto-reload register low */
  u8 CCR1H; /*!< capture/compare register 1 high */
  u8 CCR1L; /*!< capture/compare register 1 low */
  u8 CCR2H; /*!< capture/compare register 2 high */
  u8 CCR2L; /*!< capture/compare register 2 low */
  u8 CCR3H; /*!< capture/compare register 3 high */
  u8 CCR3L; /*!< capture/compare register 3 low */
}
TIM2_TypeDef;
/* my define for TIM2 value */
#define TIM2_CCMR_CCxS_OC       ((u8)0x00)
#define TIM2_CCMR1_CCxS_IC_TI1  ((u8)0x01)
#define TIM2_CCMR1_CCxS_IC_TI2  ((u8)0x02)
#define TIM2_CCMR_ICxF_8        ((u8)0x30)
#define TIM2_CCMR2_CCxS_IC_TI1  ((u8)0x02)
#define TIM2_CCMR2_CCxS_IC_TI2  ((u8)0x01)
#define TIM2_CCMR3_CCxS_IC_TI3  ((u8)0x01)

/* TIM2_Registers_Reset_Value */
#define TIM2_CR1_RESET_VALUE   ((u8)0x00)
#define TIM2_IER_RESET_VALUE   ((u8)0x00)
#define TIM2_SR1_RESET_VALUE   ((u8)0x00)
#define TIM2_SR2_RESET_VALUE   ((u8)0x00)
#define TIM2_EGR_RESET_VALUE   ((u8)0x00)
#define TIM2_CCMR1_RESET_VALUE ((u8)0x00)
#define TIM2_CCMR2_RESET_VALUE ((u8)0x00)
#define TIM2_CCMR3_RESET_VALUE ((u8)0x00)
#define TIM2_CCER1_RESET_VALUE ((u8)0x00)
#define TIM2_CCER2_RESET_VALUE ((u8)0x00)
#define TIM2_CNTRH_RESET_VALUE ((u8)0x00)
#define TIM2_CNTRL_RESET_VALUE ((u8)0x00)
#define TIM2_PSCR_RESET_VALUE  ((u8)0x00)
#define TIM2_ARRH_RESET_VALUE  ((u8)0xFF)
#define TIM2_ARRL_RESET_VALUE  ((u8)0xFF)
#define TIM2_CCR1H_RESET_VALUE ((u8)0x00)
#define TIM2_CCR1L_RESET_VALUE ((u8)0x00)
#define TIM2_CCR2H_RESET_VALUE ((u8)0x00)
#define TIM2_CCR2L_RESET_VALUE ((u8)0x00)
#define TIM2_CCR3H_RESET_VALUE ((u8)0x00)
#define TIM2_CCR3L_RESET_VALUE ((u8)0x00)

/**
  * @}
  */

/** @addtogroup TIM2_Registers_Bits_Definition
  * @{
  */

#define TIM2_CR1_ARPE ((u8)0x80) /*!< Auto-Reload Preload Enable mask. */
#define TIM2_CR1_OPM  ((u8)0x08) /*!< One Pulse Mode mask. */
#define TIM2_CR1_URS  ((u8)0x04) /*!< Update Request Source mask. */
#define TIM2_CR1_UDIS ((u8)0x02) /*!< Update DIsable mask. */
#define TIM2_CR1_CEN  ((u8)0x01) /*!< Counter Enable mask. */

#define TIM2_IER_CC3IE ((u8)0x08) /*!< Capture/Compare 3 Interrupt Enable mask. */
#define TIM2_IER_CC2IE ((u8)0x04) /*!< Capture/Compare 2 Interrupt Enable mask. */
#define TIM2_IER_CC1IE ((u8)0x02) /*!< Capture/Compare 1 Interrupt Enable mask. */
#define TIM2_IER_UIE   ((u8)0x01) /*!< Update Interrupt Enable mask. */

#define TIM2_SR1_CC3IF ((u8)0x08) /*!< Capture/Compare 3 Interrupt Flag mask. */
#define TIM2_SR1_CC2IF ((u8)0x04) /*!< Capture/Compare 2 Interrupt Flag mask. */
#define TIM2_SR1_CC1IF ((u8)0x02) /*!< Capture/Compare 1 Interrupt Flag mask. */
#define TIM2_SR1_UIF   ((u8)0x01) /*!< Update Interrupt Flag mask. */

#define TIM2_SR2_CC3OF ((u8)0x08) /*!< Capture/Compare 3 Overcapture Flag mask. */
#define TIM2_SR2_CC2OF ((u8)0x04) /*!< Capture/Compare 2 Overcapture Flag mask. */
#define TIM2_SR2_CC1OF ((u8)0x02) /*!< Capture/Compare 1 Overcapture Flag mask. */

#define TIM2_EGR_CC3G  ((u8)0x08) /*!< Capture/Compare 3 Generation mask. */
#define TIM2_EGR_CC2G  ((u8)0x04) /*!< Capture/Compare 2 Generation mask. */
#define TIM2_EGR_CC1G  ((u8)0x02) /*!< Capture/Compare 1 Generation mask. */
#define TIM2_EGR_UG    ((u8)0x01) /*!< Update Generation mask. */

#define TIM2_CCMR_ICxPSC ((u8)0x0C) /*!< Input Capture x Prescaler mask. */
#define TIM2_CCMR_ICxF   ((u8)0xF0) /*!< Input Capture x Filter mask. */
#define TIM2_CCMR_OCM    ((u8)0x70) /*!< Output Compare x Mode mask. */
#define	TIM2_CCMR_OCxPE  ((u8)0x08) /*!< Output Compare x Preload Enable mask. */
#define TIM2_CCMR_CCxS   ((u8)0x03) /*!< Capture/Compare x Selection mask. */

#define TIM2_CCER1_CC2P ((u8)0x20) /*!< Capture/Compare 2 output Polarity mask. */
#define TIM2_CCER1_CC2E ((u8)0x10) /*!< Capture/Compare 2 output enable mask. */
#define TIM2_CCER1_CC1P ((u8)0x02) /*!< Capture/Compare 1 output Polarity mask. */
#define TIM2_CCER1_CC1E ((u8)0x01) /*!< Capture/Compare 1 output enable mask. */

#define TIM2_CCER2_CC3P ((u8)0x02) /*!< Capture/Compare 3 output Polarity mask. */
#define TIM2_CCER2_CC3E ((u8)0x01) /*!< Capture/Compare 3 output enable mask. */

#define TIM2_CNTRH_CNT ((u8)0xFF) /*!< Counter Value (MSB) mask. */
#define TIM2_CNTRL_CNT ((u8)0xFF) /*!< Counter Value (LSB) mask. */

#define TIM2_PSCR_PSC ((u8)0xFF) /*!< Prescaler Value (MSB) mask. */

#define TIM2_ARRH_ARR ((u8)0xFF) /*!< Autoreload Value (MSB) mask. */
#define TIM2_ARRL_ARR ((u8)0xFF) /*!< Autoreload Value (LSB) mask. */

#define TIM2_CCR1H_CCR1 ((u8)0xFF) /*!< Capture/Compare 1 Value (MSB) mask. */
#define TIM2_CCR1L_CCR1 ((u8)0xFF) /*!< Capture/Compare 1 Value (LSB) mask. */

#define TIM2_CCR2H_CCR2 ((u8)0xFF) /*!< Capture/Compare 2 Value (MSB) mask. */
#define TIM2_CCR2L_CCR2 ((u8)0xFF) /*!< Capture/Compare 2 Value (LSB) mask. */

#define TIM2_CCR3H_CCR3 ((u8)0xFF) /*!< Capture/Compare 3 Value (MSB) mask. */
#define TIM2_CCR3L_CCR3 ((u8)0xFF) /*!< Capture/Compare 3 Value (LSB) mask. */

/**
  * @}
  */

/*----------------------------------------------------------------------------*/
/**
  * @brief 16-bit timer (TIM3)
  */
typedef volatile struct TIM3_struct
{
  u8 CR1;   /*!< control register 1 */
  u8 IER;   /*!< interrupt enable register */
  u8 SR1;   /*!< status register 1 */
  u8 SR2;   /*!< status register 2 */
  u8 EGR;   /*!< event generation register */
  u8 CCMR1; /*!< CC mode register 1 */
  u8 CCMR2; /*!< CC mode register 2 */
  u8 CCER1; /*!< CC enable register 1 */
  u8 CNTRH; /*!< counter high */
  u8 CNTRL; /*!< counter low */
  u8 PSCR;  /*!< prescaler register */
  u8 ARRH;  /*!< auto-reload register high */
  u8 ARRL;  /*!< auto-reload register low */
  u8 CCR1H; /*!< capture/compare register 1 high */
  u8 CCR1L; /*!< capture/compare register 1 low */
  u8 CCR2H; /*!< capture/compare register 2 high */
  u8 CCR2L; /*!< capture/compare register 2 low */
}
TIM3_TypeDef;

