zigaobj/smarthousehash/trunk/stm8_map.h
#define SPI_ICR_TXIE    ((u8)0x80) /*!< Tx buffer empty interrupt enable mask */
#define SPI_ICR_RXIE    ((u8)0x40) /*!< Rx buffer empty interrupt enable mask */
#define SPI_ICR_ERRIE   ((u8)0x20) /*!< Error interrupt enable mask */
#define SPI_ICR_WKIE    ((u8)0x10) /*!< Wake-up interrupt enable mask */

#define SPI_SR_BSY    ((u8)0x80) /*!< Busy flag */
#define SPI_SR_OVR    ((u8)0x40) /*!< Overrun flag */
#define SPI_SR_MODF   ((u8)0x20) /*!< Mode fault */
#define SPI_SR_CRCERR ((u8)0x10) /*!< CRC error flag */
#define SPI_SR_WKUP   ((u8)0x08) /*!< Wake-Up flag */
#define SPI_SR_TXE    ((u8)0x02) /*!< Transmit buffer empty */
#define SPI_SR_RXNE   ((u8)0x01) /*!< Receive buffer not empty */

/**
  * @}
  */

/*----------------------------------------------------------------------------*/
/**
  * @brief Single Wire Interface Module (SWIM)
  */
typedef volatile struct SWIM_struct
{
  u8 CSR; /*!< Control/Status register */
  u8 DR;  /*!< Data register */
}
SWIM_TypeDef;

/*----------------------------------------------------------------------------*/
/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter (USART)
  */

typedef volatile struct USART_struct
{
  u8 SR;   /*!< USART status register */
  u8 DR;   /*!< USART data register */
  u8 BRR1; /*!< USART baud rate register */
  u8 BRR2; /*!< USART DIV mantissa[11:8] SCIDIV fraction */
  u8 CR1;  /*!< USART control register 1 */
  u8 CR2;  /*!< USART control register 2 */
  u8 CR3;  /*!< USART control register 3 */
  u8 CR4;  /*!< USART control register 4 */
  u8 CR5;  /*!< USART control register 5 */
  u8 GTR;  /*!< USART guard time register */
  u8 PSCR; /*!< USART prescaler register */
}
USART_TypeDef;

/** @addtogroup USART_Registers_Reset_Value
  * @{
  */

#define USART_SR_RESET_VALUE   ((u8)0xC0)
#define USART_BRR1_RESET_VALUE ((u8)0x00)
#define USART_BRR2_RESET_VALUE ((u8)0x00)
#define USART_CR1_RESET_VALUE  ((u8)0x00)
#define USART_CR2_RESET_VALUE  ((u8)0x00)
#define USART_CR3_RESET_VALUE  ((u8)0x00)
#define USART_CR4_RESET_VALUE  ((u8)0x00)
#define USART_CR5_RESET_VALUE  ((u8)0x00)
#define USART_GTR_RESET_VALUE  ((u8)0x00)
#define USART_PSCR_RESET_VALUE ((u8)0x00)

/**
  * @}
  */

/** @addtogroup USART_Registers_Bits_Definition
  * @{
  */

#define USART_SR_TXE  ((u8)0x80) /*!< Transmit Data Register Empty mask */
#define USART_SR_TC   ((u8)0x40) /*!< Transmission Complete mask */
#define USART_SR_RXNE ((u8)0x20) /*!< Read Data Register Not Empty mask */
#define USART_SR_IDLE ((u8)0x10) /*!< IDLE line detected mask */
#define USART_SR_OR   ((u8)0x08) /*!< OverRun error mask */
#define USART_SR_NF   ((u8)0x04) /*!< Noise Flag mask */
#define USART_SR_FE   ((u8)0x02) /*!< Framing Error mask */
#define USART_SR_PE   ((u8)0x01) /*!< Parity Error mask */

#define USART_BRR1_DIVM ((u8)0xFF) /*!< LSB mantissa of USARTDIV [7:0] mask */

#define USART_BRR2_DIVM ((u8)0xF0) /*!< MSB mantissa of USARTDIV [11:8] mask */
#define USART_BRR2_DIVF ((u8)0x0F) /*!< Fraction bits of USARTDIV [3:0] mask */

#define USART_CR1_R8     ((u8)0x80) /*!< Receive Data bit 8 */
#define USART_CR1_T8     ((u8)0x40) /*!< Transmit data bit 8 */
#define USART_CR1_USARTD ((u8)0x20) /*!< USART Disable (for low power consumption) */
#define USART_CR1_M      ((u8)0x10) /*!< Word length mask */
#define USART_CR1_WAKE   ((u8)0x08) /*!< Wake-up method mask */
#define USART_CR1_PCEN   ((u8)0x04) /*!< Parity Control Enable mask */
#define USART_CR1_PS     ((u8)0x02) /*!< USART LINBreakLength mask */
#define USART_CR1_PIEN   ((u8)0x01) /*!< USART Parity Interrupt Enable mask */

#define USART_CR2_TIEN  ((u8)0x80) /*!< Transmitter Interrupt Enable mask */
#define USART_CR2_TCIEN ((u8)0x40) /*!< TransmissionComplete Interrupt Enable mask */
#define USART_CR2_RIEN  ((u8)0x20) /*!< Receiver Interrupt Enable mask */
#define USART_CR2_ILIEN ((u8)0x10) /*!< IDLE Line Interrupt Enable mask */
#define USART_CR2_TEN   ((u8)0x08) /*!< Transmitter Enable mask */
#define USART_CR2_REN   ((u8)0x04) /*!< Receiver Enable mask */
#define USART_CR2_RWU   ((u8)0x02) /*!< Receiver Wake-Up mask */
#define USART_CR2_SBK   ((u8)0x01) /*!< Send Break mask */

#define USART_CR3_LINEN ((u8)0x40) /*!< Alternate Function outpu mask */
#define USART_CR3_STOP  ((u8)0x30) /*!< STOP bits [1:0] mask */
#define USART_CR3_CLKEN ((u8)0x08) /*!< Clock Enable mask */
#define USART_CR3_CPOL  ((u8)0x04) /*!< Clock Polarity mask */
#define USART_CR3_CPHA  ((u8)0x02) /*!< Clock Phase mask */
#define USART_CR3_LBCL  ((u8)0x01) /*!< Last Bit Clock pulse mask */

#define USART_CR4_LBDIEN ((u8)0x40) /*!< LIN Break Detection Interrupt Enable mask */
#define USART_CR4_LBDL   ((u8)0x20) /*!< LIN Break Detection Length mask */
#define USART_CR4_LBDF   ((u8)0x10) /*!< LIN Break Detection Flag mask */
#define USART_CR4_ADD    ((u8)0x0F) /*!< Address of the USART node mask */

#define USART_CR5_SCEN  ((u8)0x20) /*!< Smart Card Enable mask */
#define USART_CR5_NACK  ((u8)0x10) /*!< Smart Card Nack Enable mask */
#define USART_CR5_HDSEL ((u8)0x08) /*!< Half-Duplex Selection mask */
#define USART_CR5_IRLP  ((u8)0x04) /*!< Irda Low Power Selection mask */
#define USART_CR5_IREN  ((u8)0x02) /*!< Irda Enable mask */

/**
  * @}
  */

/*----------------------------------------------------------------------------*/
/**
  * @brief LIN Universal Asynchronous Receiver Transmitter (LINUART)
  */

typedef volatile struct LINUART_struct
{
  u8 SR;       /*!< status register */
  u8 DR;       /*!< data register */
  u8 BRR1;     /*!< baud rate register */
  u8 BRR2;     /*!< DIV mantissa[11:8] SCIDIV fraction */
  u8 CR1;      /*!< control register 1 */
  u8 CR2;      /*!< control register 2 */
  u8 CR3;      /*!< control register 3 */
  u8 CR4;      /*!< control register 4 */
  u8 CR5;      /*!< control register 5 */
  u8 CR6;      /*!< control register 6 */
}
LINUART_TypeDef;

/** @addtogroup LINUART_Registers_Reset_Value
  * @{
  */

#define LINUART_SR_RESET_VALUE   ((u8)0xC0)
#define LINUART_BRR1_RESET_VALUE ((u8)0x00)
#define LINUART_BRR2_RESET_VALUE ((u8)0x00)
#define LINUART_CR1_RESET_VALUE  ((u8)0x00)
#define LINUART_CR2_RESET_VALUE  ((u8)0x00)
#define LINUART_CR3_RESET_VALUE  ((u8)0x00)
#define LINUART_CR4_RESET_VALUE  ((u8)0x00)
#define LINUART_CR5_RESET_VALUE  ((u8)0x00)

/**
  * @}
  */

/** @addtogroup LINUART_Registers_Bits_Definition
  * @{
  */

