zigaobj/smarthousehash/trunk/stm8_map.h
#define LINUART_SR_TXE  ((u8)0x80) /*!< Transmit Data Register Empty mask */
#define LINUART_SR_TC   ((u8)0x40) /*!< Transmission Complete mask */
#define LINUART_SR_RXNE ((u8)0x20) /*!< Read Data Register Not Empty mask */
#define LINUART_SR_IDLE ((u8)0x10) /*!< IDLE line detected mask */
#define LINUART_SR_OR   ((u8)0x08) /*!< OverRun error mask */
#define LINUART_SR_LHE  ((u8)0x08) /*!< LIN Header error mask */
#define LINUART_SR_NF   ((u8)0x04) /*!< Noise Flag mask */
#define LINUART_SR_FE   ((u8)0x02) /*!< Framing Error mask */
#define LINUART_SR_PE   ((u8)0x01) /*!< Parity Error mask */

#define LINUART_BRR1_DIVM ((u8)0xFF) /*!< LSB mantissa of LINUARTDIV [7:0] mask */

#define LINUART_BRR2_DIVM ((u8)0xF0) /*!< MSB mantissa of LINUARTDIV [11:8] mask */
#define LINUART_BRR2_DIVF ((u8)0x0F) /*!< Fraction bits of LINUARTDIV [3:0] mask */

#define LINUART_CR1_R8    ((u8)0x80) /*!< Receive Data bit 8 */
#define LINUART_CR1_T8    ((u8)0x40) /*!< Transmit data bit 8 */
#define LINUART_CR1_UARTD ((u8)0x20) /*!< UART Disable (for low power consumption) */
#define LINUART_CR1_M     ((u8)0x10) /*!< Word length mask */
#define LINUART_CR1_WAKE  ((u8)0x08) /*!< Wake-up method mask */
#define LINUART_CR1_PCEN  ((u8)0x04) /*!< Parity control enable mask */
#define LINUART_CR1_PS    ((u8)0x02) /*!< Parity selection bit mask */
#define LINUART_CR1_PIEN  ((u8)0x01) /*!< Parity interrupt enable bit mask */

#define LINUART_CR2_TIEN  ((u8)0x80) /*!< Transmitter Interrupt Enable mask */
#define LINUART_CR2_TCIEN ((u8)0x40) /*!< TransmissionComplete Interrupt Enable mask */
#define LINUART_CR2_RIEN  ((u8)0x20) /*!< Receiver Interrupt Enable mask */
#define LINUART_CR2_ILIEN ((u8)0x10) /*!< IDLE Line Interrupt Enable mask */
#define LINUART_CR2_TEN   ((u8)0x08) /*!< Transmitter Enable mask */
#define LINUART_CR2_REN   ((u8)0x04) /*!< Receiver Enable mask */
#define LINUART_CR2_RWU   ((u8)0x02) /*!< Receiver Wake-Up mask */
#define LINUART_CR2_SBK   ((u8)0x01) /*!< Send Break mask */

#define LINUART_CR3_LINEN ((u8)0x40) /*!< Alternate Function outpu mask */
#define LINUART_CR3_STOP  ((u8)0x30) /*!< STOP bits [1:0] mask */

#define LINUART_CR4_LBDIEN ((u8)0x40) /*!< LIN Break Detection Interrupt Enable mask */
#define LINUART_CR4_LBDL   ((u8)0x20) /*!< LIN Break Detection Length mask */
#define LINUART_CR4_LBDF   ((u8)0x10) /*!< LIN Break Detection Flag mask */
#define LINUART_CR4_ADD    ((u8)0x0F) /*!< Address of the LINUART node mask */

#define LINUART_CR6_LDUM   ((u8)0x80) /*!< LIN Divider Update Method */
#define LINUART_CR6_LSLV   ((u8)0x20) /*!< LIN Slave Enable */
#define LINUART_CR6_LASE   ((u8)0x10) /*!< LIN Autosynchronization Enable */
#define LINUART_CR6_LHDIEN ((u8)0x04) /*!< LIN Header Detection Interrupt Enable */
#define LINUART_CR6_LHDF   ((u8)0x02) /*!< LIN Header Detection Flag */
#define LINUART_CR6_LSF    ((u8)0x01) /*!< LIN Synch Field */

#define LINUART_CR5_SCEN   ((u8)0x20)
#define LINUART_CR5_NACK   ((u8)0x10)
#define LINUART_CR5_HDSEL  ((u8)0x08)
#define LINUART_CR5_IRLP   ((u8)0x04)
#define LINUART_CR5_IREN   ((u8)0x02)

/**
  * @}
  */
  
/*----------------------------------------------------------------------------*/
/**
  * @brief CAN Control Area Network
  */
typedef volatile struct CAN_struct
{
  u8 MCR;       /*!< main control register */
  u8 MSR;       /*!< main status register */
  u8 TSR;       /*!< transmit status register */
  u8 TPR;       /*!< transmit polarity register */
  u8 RFR;       /*!< receive FIFO register */
  u8 IER;       /*!< interrupt enable register */
  u8 DGR;       /*!< diagnose register */
  u8 PSR;       /*!< page select register 4 */
  u8 PR0;       /*!< page register 0 */
  u8 PR1;       /*!< page register 1 */
  u8 PR2;       /*!< page register 2 */
  u8 PR3;       /*!< page register 3 */
  u8 PR4;       /*!< page register 4 */
  u8 PR5;       /*!< page register 5 */
  u8 PR6;       /*!< page register 6 */
  u8 PR7;       /*!< page register 7 */
  u8 PR8;       /*!< page register 8 */
  u8 PR9;       /*!< page register 9 */
  u8 PR10;      /*!< page register 10 */
  u8 PR11;      /*!< page register 11 */
  u8 PR12;      /*!< page register 12 */
  u8 PR13;      /*!< page register 13 */
  u8 PR14;      /*!< page register 14 */
  u8 PR15;      /*!< page register 15 */
}
CAN_TypeDef;

/*****        CAN_Registers_Bits_Reset_Value        *****/

#define CAN_PAGE_BTR1_SJW_RESET_VALUE ((u8)3)
#define CAN_PAGE_BTR1_BRP_RESET_VALUE ((u8)30) //bondrate==33.33kHz
#define CAN_PAGE_BTR2_BS2_RESET_VALUE ((u8)3)
#define CAN_PAGE_BTR2_BS1_RESET_VALUE ((u8)4)


/*****        CAN_Registers_Bits_Definition        *****/

#define CAN_MCR_INRQ    ((u8)0x01)
#define CAN_MCR_SLEEP   ((u8)0x02)
#define CAN_MCR_TXFP    ((u8)0x04)
#define CAN_MCR_RFLM    ((u8)0x08)
#define CAN_MCR_NART    ((u8)0x10)
#define CAN_MCR_AWUM    ((u8)0x20)
#define CAN_MCR_ABOM    ((u8)0x40)
#define CAN_MCR_TTCM    ((u8)0x80)

#define CAN_MSR_INAK    ((u8)0x01)
#define CAN_MSR_SLAK    ((u8)0x02)
#define CAN_MSR_ERRI    ((u8)0x04)
#define CAN_MSR_WKUI    ((u8)0x08)
#define CAN_MSR_TX      ((u8)0x10)
#define CAN_MSR_RX      ((u8)0x20)

#define CAN_TSR_RQCP0   ((u8)0x01)
#define CAN_TSR_RQCP1   ((u8)0x02)
#define CAN_TSR_RQCP2   ((u8)0x04)
#define CAN_TSR_TXOK0   ((u8)0x10)
#define CAN_TSR_TXOK1   ((u8)0x20)
#define CAN_TSR_TXOK2   ((u8)0x40)

#define CAN_TPR_CODE    ((u8)0x03)
#define CAN_TPR_TME0    ((u8)0x04)
#define CAN_TPR_TME1    ((u8)0x08)
#define CAN_TPR_TME2    ((u8)0x10)
#define CAN_TPR_LOW0    ((u8)0x20)
#define CAN_TPR_LOW1    ((u8)0x40)
#define CAN_TPR_LOW2    ((u8)0x80)

#define CAN_RFR_FMP     ((u8)0x03)
#define CAN_RFR_FULL    ((u8)0x08)
#define CAN_RFR_FOVR    ((u8)0x10)
#define CAN_RFR_RFOM    ((u8)0x20)

#define CAN_IER_TMEIE   ((u8)0x01)
#define CAN_IER_FMPIE   ((u8)0x02)
#define CAN_IER_FFIE    ((u8)0x04)
#define CAN_IER_FOVIE   ((u8)0x08)
#define CAN_IER_WKUIE   ((u8)0x80)

#define CAN_DGR_LBKM    ((u8)0x01)
#define CAN_DGR_SILM    ((u8)0x02)
#define CAN_DGR_SAMP    ((u8)0x04)
#define CAN_DGR_RX      ((u8)0x08)
#define CAN_DGR_TXM2E   ((u8)0x10)

#define CAN_PSR_PS      ((u8)0x07)

#define CAN_PAGE_MCSR_ABRQ   ((u8)0x02)
#define CAN_PAGE_MCSR_TXRQ   ((u8)0x01)

