zigaobj/smarthousehash/trunk/stm8_map.h
#define CAN_PAGE_BTR1_SJW  ((u8)0xc0)
#define CAN_PAGE_BTR1_BRP  ((u8)0x3f)
#define CAN_PAGE_BTR2_CLKS ((u8)0x80)
#define CAN_PAGE_BTR2_BS2  ((u8)0x70)
#define CAN_PAGE_BTR2_BS1  ((u8)0x0f)

#define CAN_PAGE_ESR_LEC   ((u8)0x70)

#define CAN_PAGE_EIER_EWGIE  ((u8)0x01)
#define CAN_PAGE_EIER_EPVIE  ((u8)0x02)
#define CAN_PAGE_EIER_BOFIE  ((u8)0x04)
#define CAN_PAGE_EIER_LECIE  ((u8)0x10)
#define CAN_PAGE_EIER_ERRIE  ((u8)0x80)

#define CAN_ID_EXT      ((u8)0x40)

/*****        CAN_Page_Registers_Definition        *****/

// Tx MailBox
#define CAN_PAGE_MCSR    CAN.PR0
#define CAN_PAGE_MDLCR   CAN.PR1
#define CAN_PAGE_MIDR1   CAN.PR2
#define CAN_PAGE_MIDR2   CAN.PR3
#define CAN_PAGE_MIDR3   CAN.PR4
#define CAN_PAGE_MIDR4   CAN.PR5
#define CAN_PAGE_MDAR1   CAN.PR6
#define CAN_PAGE_MDAR2   CAN.PR7
#define CAN_PAGE_MDAR3   CAN.PR8
#define CAN_PAGE_MDAR4   CAN.PR9
#define CAN_PAGE_MDAR5   CAN.PR10
#define CAN_PAGE_MDAR6   CAN.PR11
#define CAN_PAGE_MDAR7   CAN.PR12
#define CAN_PAGE_MDAR8   CAN.PR13
#define CAN_PAGE_MTSRL   CAN.PR14
#define CAN_PAGE_MTSRH   CAN.PR15
// Acceptance Filter
#define CAN_PAGE_FLR1   CAN.PR0
#define CAN_PAGE_FLR2   CAN.PR1
#define CAN_PAGE_FLR3   CAN.PR2
#define CAN_PAGE_FLR4   CAN.PR3
#define CAN_PAGE_FLR5   CAN.PR4
#define CAN_PAGE_FLR6   CAN.PR5
#define CAN_PAGE_FLR7   CAN.PR6
#define CAN_PAGE_FLR8   CAN.PR7
#define CAN_PAGE_FHR1   CAN.PR8
#define CAN_PAGE_FHR2   CAN.PR9
#define CAN_PAGE_FHR3   CAN.PR10
#define CAN_PAGE_FHR4   CAN.PR11
#define CAN_PAGE_FHR5   CAN.PR12
#define CAN_PAGE_FHR6   CAN.PR13
#define CAN_PAGE_FHR7   CAN.PR14
#define CAN_PAGE_FHR8   CAN.PR15
// Control Diagnostic
#define CAN_PAGE_ESR    CAN.PR0
#define CAN_PAGE_EIER   CAN.PR1
#define CAN_PAGE_TECR   CAN.PR2
#define CAN_PAGE_RECR   CAN.PR3
#define CAN_PAGE_BTR1   CAN.PR4
#define CAN_PAGE_BTR2   CAN.PR5
#define CAN_PAGE_FMR1   CAN.PR8
#define CAN_PAGE_FMR2   CAN.PR9
#define CAN_PAGE_FCR1   CAN.PR10
#define CAN_PAGE_FCR2   CAN.PR11
#define CAN_PAGE_FCR3   CAN.PR12
//Receive FIFO
#define CAN_PAGE_MFMIR   CAN.PR0
/* 以下寄存器,Receive FIFO与Tx MailBox相同,不再重复定义
#define CAN_PAGE_MDLCR   CAN.PR1
#define CAN_PAGE_MIDR1   CAN.PR2
#define CAN_PAGE_MIDR2   CAN.PR3
#define CAN_PAGE_MIDR3   CAN.PR4
#define CAN_PAGE_MIDR4   CAN.PR5
#define CAN_PAGE_MDAR1   CAN.PR6
#define CAN_PAGE_MDAR2   CAN.PR7
#define CAN_PAGE_MDAR3   CAN.PR8
#define CAN_PAGE_MDAR4   CAN.PR9
#define CAN_PAGE_MDAR5   CAN.PR10
#define CAN_PAGE_MDAR6   CAN.PR11
#define CAN_PAGE_MDAR7   CAN.PR12
#define CAN_PAGE_MDAR8   CAN.PR13
#define CAN_PAGE_MTSRL   CAN.PR14
#define CAN_PAGE_MTSRH   CAN.PR15
*/
#define CAN_PS_TXMB0       ((u8)0) /* CAN TX mailbox 0 reg page selected */
#define CAN_PS_TXMB1       ((u8)1) /* CAN TX mailbox 1 reg page selected */
#define CAN_PS_FILTER01    ((u8)2) /* CAN Filters 0 & 1 reg page selected */
#define CAN_PS_FILTER23    ((u8)3) /* CAN Filters 2 & 3 reg page selected */
#define CAN_PS_FILTER45    ((u8)4) /* CAN Filters 4 & 5 reg page selected */
#define CAN_PS_TXMB2       ((u8)5) /* CAN TX mailbox 2 reg page selected */
#define CAN_PS_CTRL        ((u8)6) /* CAN control/status reg page selected */
#define CAN_PS_FIFO        ((u8)7) /* CAN FIFO registers page selected */


/*----------------------------------------------------------------------------*/
/**
  * @brief Configuration Registers (CFG)
  */

typedef volatile struct CFG_struct
{
  u8 GCR; /*!< Global Configuration register */
}
CFG_TypeDef;

/** @addtogroup CFG_Registers_Reset_Value
  * @{
  */

#define CFG_GCR_RESET_VALUE ((u8)0x00)

/**
  * @}
  */

/** @addtogroup CFG_Registers_Bits_Definition
  * @{
  */

#define CFG_GCR_SWD ((u8)0x01) /*!< Swim disable bit mask */
#define CFG_GCR_AL  ((u8)0x02) /*!< Activation Level bit mask */

/**
  * @}
  */
typedef volatile struct DM_struct
{
  u8 DBR0;
  u8 DBR1;
  u8 DBR2;
  u8 DBR3;
  u8 DBR4;
  u8 DBR5;
  u8 DBR6;
  u8 DBR7;
  u8 DBR8;
  u8 DBR9;
  u8 DBRA;
}
DM_TypeDef;
/**
  * @}
  */

/******************************************************************************/
/*                          Peripherals Base Address                          */
/******************************************************************************/

/** @addtogroup MAP_FILE_Base_Addresses
  * @{
  */

#define GPIOA_BaseAddress       0x5000
#define GPIOB_BaseAddress       0x5005
#define GPIOC_BaseAddress       0x500A
#define GPIOD_BaseAddress       0x500F
#define GPIOE_BaseAddress       0x5014
#define GPIOF_BaseAddress       0x5019
#define GPIOG_BaseAddress       0x501E
#define GPIOH_BaseAddress       0x5023
#define GPIOI_BaseAddress       0x5028

#define FLASH_BaseAddress       0x505A
#define OPT_BaseAddress         0x5067
#define EXTI_BaseAddress        0x50A0
#define RST_BaseAddress         0x50B3
#define CLK_BaseAddress         0x50C0
#define WWDG_BaseAddress        0x50D1
#define IWDG_BaseAddress        0x50E0
#define AWU_BaseAddress         0x50F0
#define BEEP_BaseAddress        0x50F3
#define SPI_BaseAddress         0x5200
#define I2C_BaseAddress         0x5210
#define USART_BaseAddress       0x5230
#define LINUART_BaseAddress     0x5240
#define TIM1_BaseAddress        0x5250
#define TIM2_BaseAddress        0x5300
#define TIM3_BaseAddress        0x5320
#define TIM4_BaseAddress        0x5340
#define ADC_BaseAddress         0x5400
#define CAN_BaseAddress         0x5420

#define CFG_BaseAddress         0x7F60
#define ITC_BaseAddress         0x7F70
#define SWIM_BaseAddress        0x7F80
#define DM_BaseAddress          0x7F90

/**
  * @}
  */

/******************************************************************************/
/*                          Peripherals declarations                          */
/******************************************************************************/
#if 0 //将外设寄存器定义为指针
#define GPIOA ((GPIO_TypeDef *) GPIOA_BaseAddress)
#define GPIOB ((GPIO_TypeDef *) GPIOB_BaseAddress)
#define GPIOC ((GPIO_TypeDef *) GPIOC_BaseAddress)
#define GPIOD ((GPIO_TypeDef *) GPIOD_BaseAddress)
#define GPIOE ((GPIO_TypeDef *) GPIOE_BaseAddress)
#define GPIOF ((GPIO_TypeDef *) GPIOF_BaseAddress)
#define GPIOG ((GPIO_TypeDef *) GPIOG_BaseAddress)
#define GPIOH ((GPIO_TypeDef *) GPIOH_BaseAddress)
#define GPIOI ((GPIO_TypeDef *) GPIOI_BaseAddress)
#define FLASH ((FLASH_TypeDef *) FLASH_BaseAddress)
#define OPT ((OPT_TypeDef *) OPT_BaseAddress)
#define EXTI ((EXTI_TypeDef *) EXTI_BaseAddress)
#define RST ((RST_TypeDef *) RST_BaseAddress)
#define CLK ((CLK_TypeDef *) CLK_BaseAddress)
#define WWDG ((WWDG_TypeDef *) WWDG_BaseAddress)
#define IWDG ((IWDG_TypeDef *) IWDG_BaseAddress)
#define AWU ((AWU_TypeDef *) AWU_BaseAddress)
#define BEEP ((BEEP_TypeDef *) BEEP_BaseAddress)
#define SPI ((SPI_TypeDef *) SPI_BaseAddress)
#define I2C ((I2C_TypeDef *) I2C_BaseAddress)
#define USART ((USART_TypeDef *) USART_BaseAddress)
#define LINUART ((LINUART_TypeDef *) LINUART_BaseAddress)
#define TIM1 ((TIM1_TypeDef *) TIM1_BaseAddress)
#define TIM2 ((TIM2_TypeDef *) TIM2_BaseAddress)
#define TIM3 ((TIM3_TypeDef *) TIM3_BaseAddress)
#define TIM4 ((TIM4_TypeDef *) TIM4_BaseAddress)
#define ADC ((ADC_TypeDef *) ADC_BaseAddress)
#define ITC ((ITC_TypeDef *) ITC_BaseAddress)
#define CFG ((CFG_TypeDef *) CFG_BaseAddress)
#define SWIM ((SWIM_TypeDef *) SWIM_BaseAddress)
#define DM ((DM_TypeDef *) DM_BaseAddress)
#else //将外设寄存器定义为指定地址变量
GPIO_TypeDef    GPIOA @(GPIOA_BaseAddress);
GPIO_TypeDef    GPIOB @(GPIOB_BaseAddress);
GPIO_TypeDef    GPIOC @(GPIOC_BaseAddress);
GPIO_TypeDef    GPIOD @(GPIOD_BaseAddress);
GPIO_TypeDef    GPIOE @(GPIOE_BaseAddress);
GPIO_TypeDef    GPIOF @(GPIOF_BaseAddress);
GPIO_TypeDef    GPIOG @(GPIOG_BaseAddress);
GPIO_TypeDef    GPIOH @(GPIOH_BaseAddress);
GPIO_TypeDef    GPIOI @(GPIOI_BaseAddress);
FLASH_TypeDef   FLASH @(FLASH_BaseAddress);
OPT_TypeDef     OPT 	@(OPT_BaseAddress);
EXTI_TypeDef    EXTI 	@(EXTI_BaseAddress);
RST_TypeDef     RST 	@(RST_BaseAddress);
CLK_TypeDef     CLK 	@(CLK_BaseAddress);
WWDG_TypeDef    WWDG 	@(WWDG_BaseAddress);
IWDG_TypeDef    IWDG 	@(IWDG_BaseAddress);
AWU_TypeDef     AWU 	@(AWU_BaseAddress);
BEEP_TypeDef    BEEP 	@(BEEP_BaseAddress);
SPI_TypeDef     SPI 	@(SPI_BaseAddress);
I2C_TypeDef     I2C 	@(I2C_BaseAddress);
USART_TypeDef   USART @(USART_BaseAddress);
LINUART_TypeDef LINUART @(LINUART_BaseAddress);
TIM1_TypeDef    TIM1 	@(TIM1_BaseAddress);
TIM2_TypeDef    TIM2 	@(TIM2_BaseAddress);
TIM3_TypeDef    TIM3 	@(TIM3_BaseAddress);
TIM4_TypeDef    TIM4 	@(TIM4_BaseAddress);
ADC_TypeDef     ADC 	@(ADC_BaseAddress);
CAN_TypeDef     CAN @(CAN_BaseAddress);
ITC_TypeDef     ITC 	@(ITC_BaseAddress);
CFG_TypeDef     CFG 	@(CFG_BaseAddress);
SWIM_TypeDef    SWIM 	@(SWIM_BaseAddress);
DM_TypeDef      DM 	@(DM_BaseAddress);
#endif /* Peripherals declarations */

#endif /* __STM8_MAP_H */

/******************* (C) COPYRIGHT 2007 STMicroelectronics *****END OF FILE****/
